PGM PARM(&QUALIFNAME)
DCL VAR(&QUALIFNAME) TYPE(*CHAR) LEN(20) STG(*AUTO)
DCL VAR(&NAME)       TYPE(*CHAR) LEN(10) STG(*DEFINED) DEFVAR(&QUALIFNAME  1)
DCL VAR(&LIBRARY)    TYPE(*CHAR) LEN(10) STG(*DEFINED) DEFVAR(&QUALIFNAME 11)
SNDPGMMSG MSG('Ho ricevuto indicazione per l''oggetto' *BCAT &NAME +
               *TCAT ' nella libreria' *BCAT &LIBRARY)
ENDPGM